Examples/ImmersedBC/pitzDailyImmersed/0.org/stress
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      heatFlux;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    pitzDailyIB
    {
        type groovyBC;
        patchType immersedBoundary;
        value uniform 0;
        valueExpression "normal() & snGrad(U)";
    }
    ".*"
    {
        type zeroGradient;
        patchType immersedBoundary;
    }
}


// ************************************************************************* //
